import React,{Component} from 'react';
import {Card} from 'react-bootstrap';
import Navbar from '../../Navbar/Navbar';
import './gram.css';

class Upsarga extends Component{
    constructor(props){
        super(props);
    }

    componentDidMount(){
        window.scrollTo(0, 0);
    }

    render(){
        return(
            <div className="gramTop">
            <Navbar />
            <div className="foo">
                <h1 className="paragraph">उपसर्ग </h1>
                <p className="paragraph">उपसर्ग का सम्बन्ध धातु के साथ बड़ा ही रोचक है, अथवा यह कहना ज्यादा उपयुक्त होगा कि प्र, परा आदि धातु के साथ मिलने पर ही उपसर्ग कहे जाते हैं। महर्षि पाणिनि का स्पष्ट मत है –</p>
                <p className="paragraph">प्रादयः१, उपसर्गाः क्रियायोगे २<br/> अर्थात् क्रिया के योग में प्रयुक्त ‘प्र’ आदि उपसर्ग संज्ञा को प्राप्त होते हैं। ‘उपसर्ग’ शब्द का भी सामान्यतः यही अर्थ है जो धातुओं के समीप रखे जाते हैं। उपसर्ग के महत्त्व को ध्यान में रखकर कहा गया है –</p>
                <p className="paragraph"><em>उपसर्गेण धात्वर्थः बलादन्यः प्रतीयते। </em><br/> <em>प्रहाराहारसंहारविहारपरिहारवत्।।</em></p>
                <p className="paragraph">अर्थात् उपसर्ग से जुड़ने पर धातु का (मूल) अर्थ भिन्न हो जाता है। जैसे – ‘हार’ शब्द का अर्थ पराजय या माला है, किन्तु उपसर्ग लगने पर उसका अर्थ बिलकुल अन्य ही हो जाता है।</p>
                <ul>
                <li>प्र+ हार = प्रहार = मार, चोट</li>
                <li>आ + हार = आहार = भोजन</li>
                <li>सम् + हार = संहार = विनाश</li>
                <li>वि+ हार = विहार = भ्रमण</li>
                <li>परि + हार = परिहार = वर्जन</li>
                </ul>
                <p className="paragraph">धातुओं पर उपसर्गों का प्रभाव तीन प्रकार से होता है</p>
                <p className="paragraph"><em>धात्वर्थं बाधते कश्चित् कश्चित् तमनुवर्तते।</em><br/> <em>विशिनष्टि तमेवार्थमुपसर्गगतिस्त्रिधा।।</em></p>
                <p className="paragraph">१. कहीं वह उपसर्ग धातु के मुख्य अर्थ को बाधित कर उससे बिल्कुल भिन्न अर्थ का बोध करता है। जैसे-</p>
                <ul>
                <li>भवति = होता है।</li>
                <li>परा भवति = पराजित होता है।</li>
                <li>अनु भवति = अनुभव करता है।</li>
                <li>परि भवति = अनादर करता है।</li>
                </ul>
                <p className="paragraph">२. कहीं धातु के अर्थ का ही अनुवर्तन करता है। जैसे-</p>
                <ul>
                <li>लोकयति = देखता है।</li>
                <li>बोधति = जानता है।</li>
                <li>अवलोकयति = देखता है।</li>
                <li>अवबोधति = जानता है।</li>
                <li>आलोकयति = देखता है।</li>
                <li>सु बोधति = जानता है।</li>
                <li>वि लोकयति = देखता है।</li>
                </ul>
                <p className="paragraph">३. कहीं विशेषण रूप में उसी धात्वर्थ को और भी विशिष्ट बना देता है। जैसे</p>
                <ul>
                <li>कम्पते = काँपता है।</li>
                <li>प्रकम्पते = प्रकृष्ट रूप से काँपता है।</li>
                <li>आकम्पते = पूरी तरह से काँपता है।</li>
                <li>वि कम्पते = विशेष रूप से काँपता है।</li>
                </ul>
                <p className="paragraph">उपसर्ग संख्या में २२ हैं, जो अग्रलिखित हैं – प्र, परा, अप, सम्, अनु, अव, निस्, निर्, दुस्, दुर्, वि, आङ्, नि, अधि, अपि, अति, सु, उत्, अभि, प्रति, परि तथा उप।</p>
                <p className="paragraph">धातु के साथ लगकर ये विशिष्ट अर्थ का बोध कराते हैं, किन्तु धातु योग रहने पर इनका सामान्य अर्थ भी इस प्रकार बताया गया है –</p>
                <p className="paragraph">प्र- अधिक या प्रकर्ष; परा – उलटा, पीछे; अप – इसका उल्टा, दूर; सम् – अच्छी तरह, एक साथ; अनु – पीछे; अव – नीचे, दूर; निस्– विना, बाहर; निर् – बाहर, उलटा; दुस् – कठिन, उलटा; दुर् – बुरा; वि- विना, अलग, विशेष रूप से; आङ् – तक, इधर; नि-नीचे; अधि- ऊपर या सबसे ऊपर; अपि- निकट, संसर्ग; अति-बहुत अधिक; सु-सुन्दर, आदर; उत्- ऊपर; अभि – सामने, ओर; प्रति – ओर, उलटा; परि – चारो ओर, उप – समीप।</p><p className="paragraph">उपसर्ग के साथ प्रयुक्त कुछ धातु रूप</p>
                <p className="paragraph">१. प्र:</p>
                <ul>
                    <li>प्र+भवति = प्रभवति = प्रकट होता है।</li>
                    <li>प्र + नमति = प्रणमति = झुककर प्रणाम करता है।</li>
                    <li>प्र + नयति = प्रणयति = रचना (या प्रेम) करता है।</li>
                    <li>प्र + हरति = प्रहरति = प्रहार करता है।</li>
                    </ul>
                    <p className="paragraph">२. परा :</p>
                    <ul>
                        <li>परा + भवति = परा भवति = पराजित होता है।</li>
                        <li>परा + जयति = पराजयते = पराजित करता है।</li>
                        <li>परा + अयते = पलायते = भागता है।</li>
                        <li>परा + करोति = पराकरोति = भगाता है।</li>
                        </ul>
                    <p className="paragraph">३. अप :</p>
                    <ul><li>अप + करोति = अपकरोति = बुराई करता है।</li><li>अप + सरति = अपसरति = दूर हटता है।</li><li>अप+जानाति = अपजानीते = अस्वीकार करता है।</li><li>अप + एति = अपैति = दूर होता है।</li></ul><p className="paragraph">४. सम् :</p><ul><li>सम् + भवति = सम्भवति = सम्भव होता है।</li><li>सम् + क्षिपति = संक्षिपति = संक्षेप करता है।</li><li>सम् + चिनोति = सञ्चिनोति = इकट्ठा करता है।</li><li>सम् + गृह्णाति = संगृह्णाति = संग्रह करता है।</li></ul><p className="paragraph">५. अनु :</p><ul><li>अनु + भवति = अनुभवति = अनुभव करता है।</li><li>अनु + करोति = अनुकरोति = अनुकरण करता है।</li><li>अनु + गच्छति = अनुगच्छति = पीछे जाता है।</li><li>अनु + जानाति = अनुजानाति = आज्ञा देता है।</li><li>अव + गच्छति = अवगच्छति = समझता है।</li><li>अव + क्षिपति = अवक्षिपति = निन्दा करता है।</li><li>अव + जानाति = अवजानाति = अनादर करता है।</li><li>अव + तरति = अवतरति = नीचे उतरता है।</li><li>निस + सरति = निस्सरति = निकलता है।</li><li>निस + चिनोति = निश्चिनोति = निश्चय करता है।</li><li>निस् + क्रामति = निष्कामति = निकलता है।</li><li>निस + तरति = निस्तरति = समाप्त करता है।</li></ul><p className="paragraph">८. निर् :</p><ul><li>निर् + ईक्षते = निरीक्षते = निगरानी करता है।</li><li>निर् + वहति = निर्वहति = निर्वहन करता है।</li><li>निर् + अस्यति = निरस्यति = हटाता है।</li><li>निर + गच्छति = निर्गच्छति = निकलता है।</li></ul><p className="paragraph">९. दुस् :</p><ul><li>दुस् + चरति = दुश्चरति = बुरा काम करता है।</li><li>दुस् + करोति = दुष्करोति = दुष्कर्म करता है।</li><li>दुस् + तरति = दुस्तरति = कठिनाई से तैरता है।</li></ul><p className="paragraph">१०. दुर् :</p><ul><li>दुर् + बोधति = दुर्बोधति = कठिनाइयों से समझता है।</li><li>दुर् + गच्छति = दुर्गच्छति = दुःख भोगता है।</li><li>दुर् + नयति = दुर्नयति = अन्याय करता है।</li></ul><p className="paragraph">११. वि :</p><ul><li>वि + तरति = वितरति = बाँटता है।</li><li>वि + आप्नोति = व्याप्नोति = फैलता है।</li><li>वि + नयति = विनयते = चुकाता है।</li><li>वि + जयति = विजयते = जीतता है।</li></ul><p className="paragraph">१२. आङ् :</p><ul><li>आ+ नयति = आनयति = लाता है।</li><li>आ + चरति = आचरति = आचरण करता है।</li><li>आ + गच्छति = आगच्छति = आता है।</li><li>आ + रोहति = अरोहति = चढ़ता है।</li></ul><p className="paragraph">१३. नि :</p><ul><li>नि + वेदयति = निवेदयति = निवेदन करता है।</li><li>नि+ वर्तते = निवर्तते = लौटता है।</li><li>नि + विशति = निविशते = घुसता है।</li><li>नि + दधाति निदधाति = विश्वास रखता है।</li></ul><p className="paragraph">१४. अधि :</p><ul><li>अधि + करोति = अधिकरोति = अधिकार करता है।</li><li>अधि + गच्छति = अधिगच्छति = प्राप्त करता है।</li><li>अधि + आस्ते = अध्यास्ते = बैठता है।</li><li>अधि + वसति = अधिवसति = निवास करता है।</li></ul><p className="paragraph">१५. अपि :</p><ul><li>अपि + गिरति = अपिगिरति = स्तुति करता है।</li><li>अपि + धत्ते = अपिधत्ते = हँकता है।</li></ul><p className="paragraph">१६. अति :</p><ul><li>अति + शेते = अतिशेते = बढ़कर होता है।</li><li>अति + वाहयति = अतिवाहयति = बिताता है।</li><li>अति + क्रामति = अतिक्रामति = अतिक्रमण करता है।</li><li>अति + एति = अत्येति = पार करता है।</li></ul><p className="paragraph">१७. सु :</p><ul><li>सु + पचति = सुपचति = अच्छी तरह पकाता है।</li><li>सु + शोभते = सुशोभते = बहुत शोभता है।</li><li>सु + चरति = सुचरति = अच्छा वर्ताव करता है।</li><li>स + करोति = सकरोति = पुण्य करता है।</li></ul><p className="paragraph">१८. उत् :</p><ul><li>उत् + गच्छति = उद्गच्छति = ऊपर जाता है।</li><li>उत् + भवति = उद्भवति = उत्पन्न होता है।</li><li>उत् + तिष्ठति = उत्तिष्ठति = उठता है।</li><li>उत् + हरति = उद्धरति = उद्धृत करता है।</li></ul><p className="paragraph">१९. अभि :</p><ul><li>अभि + भवति = अभिभवति = अपमानित करता है।</li><li>अभि + मन्यते = अभिमन्यते = अभिमान करता है।</li><li>अभि + अस्यति = अभ्यस्यति = अभ्यास करता है।</li><li>अभि + दधाति = अभिदधाति = कहता है।</li></ul><p className="paragraph">२०. प्रति :</p><ul><li>प्रति + करोति = प्रतिकरोति = प्रतिकार या उपाय करता है। .</li><li>प्रति + ईक्षते = प्रतीक्षते = प्रतीक्षा करता है।</li><li>प्रति + गृह्णाति = प्रतिगृह्णाति = स्वीकार करता है।</li><li>प्रति + एति = प्रत्येति = विश्वास करता है।</li></ul><p className="paragraph">२१. परिः</p><ul><li>परि + नयति = परिणयति = विवाह करता है।</li><li>परि + ईक्षते = परीक्षते = परीक्षा लेता है।</li><li>परि + क्रमते = परिक्रमते = परिक्रमा करता है।</li><li>परि + दधाति = परिदधाति = पहनता है।</li></ul><p className="paragraph">२२. उप :</p><ul><li>उप + करोति = उपकरोति = उपकार करता है।</li><li>उप + दिशति = उपदिशति = उपदेश देता है।</li><li>उप + एति = उपैति = निकट जाता है।</li><li>उप + चरति = उपचरति = सेवा करता है।</li><li>उप + नयति = उपनयति = समीप लाता है।</li></ul>
                    <h3 className="paragraph">संस्कृत उपसर्गों से बनने वाले शब्द</h3>
                    <p className="paragraph">१. प्र-प्रगति, प्रभाव, प्रवेश, प्रवाह, प्रणय<br/> २. परा- पराजय, पराभव, पराकाष्ठा<br/> ३. अप- अपयश, अपव्यय, अपकार, अपमान, अपवाद<br/> ४. ‘सम्-संहार, संसार, संगति, सम्वेदना, संवाद<br/> ५. अनु- अनुचर, अनुज, अनुभव, अनुमान, अनुनय<br/> ६. अव-अवसाद, अवमान, अवरोध, अवरोह, अवकाश<br/> ७. निस् – निस्तेज, निष्काम, निस्तार, निश्चय, निस्सार<br/> ८. निर्-निरादर, निर्वेद, निर्णय, निराकरण, निर्भय<br/> ९. दुस्-दुष्कर, दुस्तर, दुष्प्राप्य, दुःसाध्य, दुस्सह<br/> १०. दुर्-दुर्बोध, दुर्योधन, दुराशा, दुराग्रह, दुर्गम<br/> ११. वि-विनय, विरोध, विचार, विभाव, विहार<br/> १२. आङ्-आहार, आगम, आचार, आदान, आकर्षण<br/> १३. नि-निवेदन, नियम, निवास, निरोध, निषेध<br/> १४. अधि- अधिकार, अधिगम, अधिमान, अधिभार<br/> १५. अपि-अपिधान, अपिहित, अपिगीर्ण, अपिधि<br/> १६. अति- अतिशय, अतिचार, अतिवृष्टि, अतिक्रमण<br/> १७. सु-सुबोध, सुलभ, सुप्रसिद्ध, सुराग, सुदिन<br/> १८. उत्- उद्बोध, उद्भव, उत्पति, उन्नति, उद्गम<br/> १९. अभि- अभिमान, अभिवादन, अभियोग, अभिलाप<br/> २०. प्रति- प्रतिकार, प्रत्येक, प्रतिदिन, प्रतिपक्ष, प्रतिपद<br/> २१. परि-परिहार, परिचय, परिभव, परिमाण, परिणय<br/> २२. उप- उपहार, उपदेश, उपवास, उपनयन, उपकार</p><p className="paragraph">णत्वविधान<br/> विभिन्न स्थितियों में ‘न्’ का ‘ण’ में परिवर्तित हो जाना ही णत्व-विधान है। इसके विधान के लिए कुछ प्रमुख पाणिनि सूत्र इस प्रकार हैं –</p>
                    <p className="paragraph">१. रषाभ्यां नो णः समानपदे? –<br/> एक ही पद में र, ष् अथवा ‘ऋ’ के बाद ‘न्’ रहे तो उस<br/> (न्) का ‘ण’ हो जाता है। जैसे – चतुर्णाम्, पुष्णाति, वृक्षाणाम्।</p><p className="paragraph">२. अट्कुप्वानुम्व्यवायेऽपि२ –<br/> (अट् + कु + पु+ आङ् + नुम् + व्यवाये + अपि) अर्थात् ‘र’ और ‘ष’ के बाद किन्तु ‘न्’ से पहले अर्थात् दोनो के बीच अट् (अ, इ, उ, ऋ, लु, ए, ओ, ऐ औ, ह, य, व, र) वर्ण, कु (क्, ख, ग, घ, ङ्), पु (प, फ, ब, भ, म्), आङ् तथा नुम् में से किसी वर्ण के रहने पर भी ‘न्’ का ‘ण्’ हो जाता है।</p><p className="paragraph">जैसे –</p><ul><li>हरिणा, दर्भेण, ग्रहेण, रामाणाम्, तरूणाम्।</li></ul><p className="paragraph">किन्तु उपरि निर्दिष्ट वर्गों के अतिरिक्त किसी भी वर्ण से व्यवधान रहने पर ‘न’ का ‘ण’ नहीं होता है। जैसे – सरलेन, अर्थेन, अर्चनम्, रसानाम् आदि।</p><p className="paragraph">३. पूर्वपदात संज्ञायामगः ३ – दो पदों के मिलने पर संज्ञावाचक होने की स्थिति में पूर्वपद में ऋ, र या ष में से कोई वर्ण रहे और कहीं भी ‘ग’ नहीं रहे तो उत्तर पद में विद्यमान ‘न’ का ‘ण’ हो जाता है।</p><p className="paragraph">जैसे –</p><ul><li>राम + अयनम् = रामायणम्</li><li>शूर्प+ नखा = शूर्पणखा</li><li>अग्र + नीः = अग्रणीः</li><li>पर + अयनम् = परायणम्</li><li>नार + अयनः – नारायणः</li><li>अक्ष + ऊहिनी = अक्षौहिणी</li><li>धर्म + अयनम् = धर्मायणम्</li></ul><p className="paragraph">गकार रहने पर ‘न्’ का ‘ण’ नहीं होता है।<br/> जैसे –</p><ul><li>त्रक् + अयनम् = ऋगयनम्</li></ul><p className="paragraph">४. अहोऽदन्तात् – अदन्त या अकारान्त पूर्वपद में ‘र’ अथवा ‘ष’ रहने पर उत्तरवर्ती अहन् (अह्न) के ‘न्’ का ‘ण’ हो जाता है।</p><p className="paragraph">जैसे</p><ul><li>पूर्व + अहन् = पूर्वाण</li><li>सर्व+ अहन = सर्वाह्न</li><li>अपर + अहन् = अपराह्न।</li></ul><p className="paragraph">५. कृत्यचः५ – रकार से युक्त उपसर्ग के बाद कृत् प्रत्यय से बने शब्द में अच् (स्वर) वर्ण के बाद ‘न्’ रहे तो उसके स्थान में ‘ण’ आदेश हो जाता है।<br/> जैसे –</p><ul><li>प्र + मानम् = प्रमाणम्</li><li>प्र + यानम् = प्रयाणम्</li><li>निर + विन्नः = निर्विण्णः</li><li>निर् + वानम् = निर्वाणम्</li><li>परि + मानम् = परिमाणम्</li><li>परि + नयः = परिणयः</li></ul><p className="paragraph">पदान्तस्य’ – पदान्त ‘न्’ का ‘ण’ नहीं होता है। जैसे – रामान्, हरीन्, भ्रातृन्।</p><p className="paragraph">कुछ शब्द स्वतः ‘ण’ वर्ण वाले हैं, जिनमें णत्व करने की आवश्यकता नहीं होती।<br/> जैसे –</p><ul><li>कणः, गणः, गुणः, मणिः, फणी, वाणी।</li></ul><p className="paragraph">षत्वविधान<br/> कुछ स्थितियों में ‘स्’ के स्थान में ‘ए’ का आ जाना ही षत्वविधान है। इसके विधान के लिए कुछ नियम इस प्रकार हैं</p><p className="paragraph">१. इण्कोः आदेशप्रत्ययोः२ – इण (अकार को छोड़कर सभी स्वर इ, उ, ऋ, ल, ए, ऐ, ओ, औ तथा य, र, ल, व और ह्) एवं कु (क, ख, ग, घ, ङ्) से परे आदेश स्वरूप तथा प्रत्यय के अवयव भूत ‘स्’ के स्थान में ‘ष’ आदेश हो जाता है।</p><p className="paragraph">जैसे –</p><ul><li>हरि + सु = हरिषु</li><li>पठि + स्यति = पठिष्यति</li><li>साधु+सु= साधुषु</li><li>चतुर् + सु = चतुर्यु</li><li>पितृ + सु = पितृषु</li><li>सेवि + स्यते = सेविष्यते</li><li>रामे + सु = रामेषु</li><li>चे+ स्यति = चेष्यति</li><li>गो + सु = गोषु</li><li>वाक् + सु = वाक्षु</li></ul><p className="paragraph">२. नुम्विसर्जनीयशर्यवायेऽपि३ — इण एवं कवर्ग और उनसे उत्तरवर्ती सकार के बीच नुम्, विसर्ग तथा शर् प्रत्याहार के (श्, ष, स्) वर्ण रहने पर भी ‘स्’ का ‘ए’ आदेश हो जाता है।<br/> जैसे –</p><ul><li>नुम् = हवी + न् + सि = हवींषि</li><li>धनु + न् + सि = धषि</li><li>विसर्ग = आयुः + सु = आयुःषु</li><li>आशीः + सु = आशीःषु</li><li>शर् = सर्पिष् + सु = सर्पिष्षु</li><li>सजुष् + सु = सजुष्षु</li></ul><p className="paragraph">३. उपसर्गात्सुनोतिसुवतिस्यति स्वञ्जाम् – इण् (इ और उकार) अन्त वाले उपससर्ग से परे सुनोति, सुवति, स्यति, स्तौति आदि धातु रूप के ‘स्’ के स्थान में ‘ष’ आदेश हो जाता है। जैसे –</p><ul><li>अभि + सुनोति = अभिषुनोति</li><li>परि + सुवति = परिषुवति</li><li>अभि + स्यति = अभिष्यति।</li><li>सु + स्तुता = सुष्टुता</li><li>परि + सिञ्चति = परिषिञ्चति</li><li>प्रति + सेधः = प्रतिषेधः</li><li>प्रति + स्थितः = प्रतिष्ठितः</li><li>अभि + सर्जति = अभिषर्जति</li></ul><p className="paragraph">४. सदिरपतेः५ – ‘प्रति’ से भिन्न इण (इ, उ) वर्ण वाले उपसर्ग के बाद विद्यमान सद् (षद्लू) धातु के भी ‘स्’ के स्थान में ‘ष’ हो जाता है। जैसे-</p><p className="paragraph">५. परिनिविभ्यः सेवसित….सज्जाम् – ‘परि’, ‘नि’ और ‘वि’ इन उपसर्गों के बाद प्रयुक्त ‘सेव’ सित, सिव आदि धातुओं के ‘स्’ का ‘ए’ हो जाता है। जैसे-</p><ul><li>परि + सेवते = परिषेवते</li><li>नि + सेवते = निषेवते</li><li>परि + सितः = परिषितः</li><li>नि + सितः = निषितः</li><li>परि + सीव्यति = परिषीव्यति</li><li>वि + सहते= विषहते</li></ul><p className="paragraph">स्फुरतिस्फुलत्योर्निनिविभ्यः २ – ‘निस्’, ‘नि’ अथवा ‘वि’ उपसर्ग के बाद वर्तमान स्फुर् और स्फुल् धातुओं के सकार का विकल्प से षकार आदेश हो जाता है।<br/> जैसे –</p><ul><li>नि + स्फुरति = निष्फुरति</li><li>वि + स्फुरति = विष्फुरति</li></ul><p className="paragraph">सुबिनिदुर्थ्यः सुविसूतिसमाः ३ – ‘सु’, ‘वि’, ‘निर्’ अथवा ‘दुर्’ उपसर्ग से परे सुप्, सूति और सम शब्दों के सकार के स्थान में षकार आदेश हो जाता है।</p><p className="paragraph">जैसे-</p><ul><li>सु + सुप्तः = सुषुप्तः</li><li>वि + सुप्तः = विषुप्तः</li><li>सु + सूतिः = सुषूतिः</li><li>वि + सूतिः = विषूतिः</li><li>दुर् + सूतिः = दुःषूतिः</li><li>वि + समः = विषमः</li><li>दुर् + समः = दुःषमः</li><li>निर् + सूतिः = निःषूतिः</li></ul><p className="paragraph">निनदीभ्यां स्नातेः कौशले ४- कौशल ( = निपुणता) अर्थ प्रतीत होने पर ‘नि’ और ‘नदी’ शब्दों के बाद प्रयुक्त स्ना धातु के भी सकार का षकार आदेश हो जाता है। जैसे-</p><ul><li>नि+ स्नातः = निष्णातः</li><li>नदी + स्नः = नदीष्णः</li></ul><p className="paragraph">मातृपितृभ्यां स्वसा५ – ‘मातृ’ और ‘पितृ’ शब्दों से परे ‘स्वसृ’ शब्द रहने पर ‘स्’ का ‘ए’ हो जाता है।<br/> जैसे –</p><ul><li>मातृ + स्वसा = मातृष्वसा</li><li>पितृ + स्वसा = पितृष्वसा</li></ul><p className="paragraph">गवियुधिभ्यां स्थिरः६ – ‘गवि’ और ‘युधि’ शब्दों से परवर्ती ‘स्थिर’ के ‘स्’ का ‘ष’ हो जाता है।<br/> जैसे-</p><ul><li>गवि + स्थिरः = गविष्ठिरः</li><li>युधि + स्थिरः = युधिष्ठिरः</li></ul><p className="paragraph">उपर्युक्त नियमों के अतिरिक्त भी अनेक ऐसे शब्द या स्थल हैं, जहाँ ‘स्’ की जगह ‘ए’ हो जाता है।<br/> जैसे-</p><ul><li>प्र + स्थः = प्रष्ठः</li><li>वि + स्तरः = विष्टरः</li><li>भूमि + स्थः = भूमिष्ठः</li><li>अङ्गु + स्थः = अङ्गुष्ठः</li><li>सु + सेनः = सुषेणः</li><li>कु + स्थः = कुष्ठः</li><li>परमे + स्थी = परमेष्ठी</li><li>गो + स्थः = गोष्ठः</li></ul>
            </div>
            </div>
        )
    }
}

export default Upsarga;